Samsung/TizenRT/os/board/bk7239n/src/middleware/soc/bk7239n/soc/pwm_struct.h
typedef volatile struct {
	volatile pwm_reg0_t reg0;
	volatile pwm_reg1_t reg1;
	volatile pwm_reg2_t reg2;
	volatile pwm_reg3_t reg3;
	volatile pwm_reg4_t reg4;
	volatile uint32_t rsv_5_f[11];
	volatile pwm_reg10_t reg10;
	volatile pwm_reg11_t reg11;
	volatile pwm_reg12_t reg12;
	volatile pwm_reg13_t reg13;
	volatile pwm_reg14_t reg14;
	volatile pwm_reg15_t reg15;
	volatile pwm_reg16_t reg16;
	volatile pwm_reg17_t reg17;
	volatile pwm_reg18_t reg18;
	volatile pwm_reg19_t reg19;
	volatile pwm_reg1a_t reg1a;
	volatile pwm_reg1b_t reg1b;
	volatile uint32_t rsv_1c_1f[4];
	volatile pwm_reg20_t reg20;
	volatile pwm_reg21_t reg21;
	volatile pwm_reg22_t reg22;
	volatile pwm_reg23_t reg23;
	volatile pwm_reg24_t reg24;
	volatile pwm_reg25_t reg25;
	volatile pwm_reg26_t reg26;
	volatile pwm_reg27_t reg27;
	volatile pwm_reg28_t reg28;
	volatile pwm_reg29_t reg29;
	volatile pwm_reg2a_t reg2a;
	volatile pwm_reg2b_t reg2b;
	volatile pwm_reg2c_t reg2c;
	volatile pwm_reg2d_t reg2d;
	volatile pwm_reg2e_t reg2e;
	volatile pwm_reg2f_t reg2f;
	volatile pwm_reg30_t reg30;
	volatile pwm_reg31_t reg31;
	volatile pwm_reg32_t reg32;
	volatile pwm_reg33_t reg33;
	volatile pwm_reg34_t reg34;
	volatile pwm_reg35_t reg35;
	volatile pwm_reg36_t reg36;
	volatile pwm_reg37_t reg37;
	volatile uint32_t rsv_38_3f[8];
	volatile pwm_reg40_t reg40;
	volatile pwm_reg41_t reg41;
	volatile pwm_reg42_t reg42;
	volatile pwm_reg43_t reg43;
	volatile pwm_reg44_t reg44;
	volatile pwm_reg45_t reg45;
	volatile pwm_reg46_t reg46;
	volatile pwm_reg47_t reg47;
	volatile pwm_reg48_t reg48;
	volatile pwm_reg49_t reg49;
	volatile pwm_reg4a_t reg4a;
	volatile pwm_reg4b_t reg4b;
	volatile pwm_reg4c_t reg4c;
	volatile pwm_reg4d_t reg4d;
	volatile pwm_reg4e_t reg4e;
	volatile pwm_reg4f_t reg4f;
	volatile pwm_reg50_t reg50;
	volatile pwm_reg51_t reg51;
	volatile pwm_reg52_t reg52;
	volatile pwm_reg53_t reg53;
	volatile pwm_reg54_t reg54;
	volatile pwm_reg55_t reg55;
	volatile pwm_reg56_t reg56;
	volatile pwm_reg57_t reg57;
	volatile pwm_reg58_t reg58;
	volatile pwm_reg59_t reg59;
	volatile pwm_reg5a_t reg5a;
	volatile pwm_reg5b_t reg5b;
	volatile pwm_reg5c_t reg5c;
	volatile pwm_reg5d_t reg5d;
	volatile pwm_reg5e_t reg5e;
	volatile pwm_reg5f_t reg5f;
	volatile pwm_reg60_t reg60;
	volatile pwm_reg61_t reg61;
	volatile pwm_reg62_t reg62;
	volatile pwm_reg63_t reg63;
	volatile pwm_reg64_t reg64;
	volatile pwm_reg65_t reg65;
	volatile pwm_reg66_t reg66;
	volatile pwm_reg67_t reg67;
	volatile pwm_reg68_t reg68;
	volatile pwm_reg69_t reg69;
	volatile pwm_reg6a_t reg6a;
	volatile pwm_reg6b_t reg6b;
	volatile pwm_reg6c_t reg6c;
	volatile pwm_reg6d_t reg6d;
	volatile uint32_t rsv_6e_7f[18];
	volatile pwm_reg80_t reg80;
	volatile pwm_reg81_t reg81;
	volatile pwm_reg82_t reg82;
	volatile pwm_reg83_t reg83;
	volatile pwm_reg84_t reg84;
	volatile pwm_reg85_t reg85;
	volatile pwm_reg86_t reg86;
	volatile pwm_reg87_t reg87;
	volatile pwm_reg88_t reg88;
	volatile pwm_reg89_t reg89;
	volatile pwm_reg8a_t reg8a;
	volatile pwm_reg8b_t reg8b;
	volatile pwm_reg8c_t reg8c;
	volatile pwm_reg8d_t reg8d;
	volatile pwm_reg8e_t reg8e;
	volatile pwm_reg8f_t reg8f;
	volatile pwm_reg90_t reg90;
	volatile pwm_reg91_t reg91;
	volatile pwm_reg92_t reg92;
	volatile pwm_reg93_t reg93;
	volatile pwm_reg94_t reg94;
	volatile pwm_reg95_t reg95;
	volatile pwm_reg96_t reg96;
	volatile pwm_reg97_t reg97;
	volatile pwm_reg98_t reg98;
	volatile pwm_reg99_t reg99;
	volatile pwm_reg9a_t reg9a;
	volatile pwm_reg9b_t reg9b;
	volatile pwm_reg9c_t reg9c;
	volatile pwm_reg9d_t reg9d;
	volatile pwm_reg9e_t reg9e;
	volatile pwm_reg9f_t reg9f;
	volatile pwm_rega0_t rega0;
	volatile pwm_rega1_t rega1;
	volatile pwm_rega2_t rega2;
	volatile pwm_rega3_t rega3;
	volatile pwm_rega4_t rega4;
	volatile pwm_rega5_t rega5;
	volatile pwm_rega6_t rega6;
	volatile pwm_rega7_t rega7;
	volatile pwm_rega8_t rega8;
	volatile pwm_rega9_t rega9;
	volatile pwm_regaa_t regaa;
	volatile pwm_regab_t regab;
	volatile pwm_regac_t regac;
	volatile pwm_regad_t regad;
	volatile uint32_t rsv_ae_bf[18];
	volatile pwm_regc0_t regc0;
	volatile pwm_regc1_t regc1;
	volatile pwm_regc2_t regc2;
	volatile pwm_regc3_t regc3;
	volatile pwm_regc4_t regc4;
	volatile pwm_regc5_t regc5;
	volatile pwm_regc6_t regc6;
	volatile pwm_regc7_t regc7;
	volatile pwm_regc8_t regc8;
	volatile pwm_regc9_t regc9;
	volatile pwm_regca_t regca;
	volatile pwm_regcb_t regcb;
	volatile pwm_regcc_t regcc;
	volatile pwm_regcd_t regcd;
	volatile pwm_regce_t regce;
	volatile pwm_regcf_t regcf;
	volatile pwm_regd0_t regd0;
	volatile pwm_regd1_t regd1;
	volatile pwm_regd2_t regd2;
	volatile pwm_regd3_t regd3;
	volatile pwm_regd4_t regd4;
	volatile pwm_regd5_t regd5;
	volatile pwm_regd6_t regd6;
	volatile pwm_regd7_t regd7;
	volatile pwm_regd8_t regd8;
	volatile pwm_regd9_t regd9;
	volatile pwm_regda_t regda;
	volatile pwm_regdb_t regdb;
	volatile pwm_regdc_t regdc;
	volatile pwm_regdd_t regdd;
	volatile pwm_regde_t regde;
	volatile pwm_regdf_t regdf;
	volatile pwm_rege0_t rege0;
	volatile pwm_rege1_t rege1;
	volatile pwm_rege2_t rege2;
	volatile pwm_rege3_t rege3;
	volatile pwm_rege4_t rege4;
	volatile pwm_rege5_t rege5;
	volatile pwm_rege6_t rege6;
	volatile pwm_rege7_t rege7;
	volatile pwm_rege8_t rege8;
	volatile pwm_rege9_t rege9;
	volatile pwm_regea_t regea;
	volatile pwm_regeb_t regeb;
	volatile pwm_regec_t regec;
	volatile pwm_reged_t reged;
	volatile uint32_t rsv_ee_ff[18];
	volatile pwm_reg100_t reg100;
	volatile pwm_reg101_t reg101;
	volatile pwm_reg102_t reg102;
	volatile pwm_reg103_t reg103;
	volatile pwm_reg104_t reg104;
	volatile pwm_reg105_t reg105;
	volatile pwm_reg106_t reg106;
	volatile pwm_reg107_t reg107;
	volatile pwm_reg108_t reg108;
	volatile pwm_reg109_t reg109;
	volatile pwm_reg10a_t reg10a;
	volatile pwm_reg10b_t reg10b;
	volatile pwm_reg10c_t reg10c;
	volatile pwm_reg10d_t reg10d;
	volatile pwm_reg10e_t reg10e;
	volatile pwm_reg10f_t reg10f;
	volatile pwm_reg110_t reg110;
	volatile pwm_reg111_t reg111;
	volatile pwm_reg112_t reg112;
	volatile pwm_reg113_t reg113;
	volatile pwm_reg114_t reg114;
	volatile pwm_reg115_t reg115;
	volatile pwm_reg116_t reg116;
	volatile pwm_reg117_t reg117;
	volatile pwm_reg118_t reg118;
	volatile pwm_reg119_t reg119;
	volatile pwm_reg11a_t reg11a;
	volatile pwm_reg11b_t reg11b;
	volatile pwm_reg11c_t reg11c;
	volatile pwm_reg11d_t reg11d;
	volatile pwm_reg11e_t reg11e;
	volatile pwm_reg11f_t reg11f;
	volatile pwm_reg120_t reg120;
	volatile pwm_reg121_t reg121;
	volatile pwm_reg122_t reg122;
	volatile pwm_reg123_t reg123;
	volatile pwm_reg124_t reg124;
	volatile pwm_reg125_t reg125;
	volatile pwm_reg126_t reg126;
	volatile pwm_reg127_t reg127;
	volatile pwm_reg128_t reg128;
	volatile pwm_reg129_t reg129;
	volatile pwm_reg12a_t reg12a;
	volatile pwm_reg12b_t reg12b;
	volatile pwm_reg12c_t reg12c;
	volatile pwm_reg12d_t reg12d;
} pwm_hw_t;

#ifdef __cplusplus
}
#endif
